#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.ecs.aws_iam_role_policy_attachment.task_exec_additional: Refreshing state... [id=taskRole-20231102180319309600000001]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0e0c633e556405c5b]
module.ecs.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::834794241069:policy/getSecretELog]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:cluster/soat1-grp13-tech-challenge]
module.s3.aws_s3_bucket.lambda_s3: Refreshing state... [id=tech-challenge-soat1-grp13-s3-auth]
module.databases.aws_dynamodb_table.customer_db: Refreshing state... [id=customers_cache]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Reading...
module.secrets.aws_secretsmanager_secret.secrets: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:soat1-grp13-Cfh8wD]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Read complete after 0s [id=2291109037]
module.ecs.aws_iam_role.task_exec: Refreshing state... [id=taskRole]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=soat1-grp13-tech-challenge]
module.ecs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/soat1-grp13-tech-challenge]
module.ecs.data.aws_iam_policy_document.task_exec: Reading...
module.ecs.data.aws_iam_policy_document.task_exec: Read complete after 0s [id=4249186570]
module.ecs.aws_iam_role_policy_attachment.default: Refreshing state... [id=taskRole-20231102172503320700000001]
module.ecs.aws_ecs_task_definition.this: Refreshing state... [id=soat1-grp13-api]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-0e633156cbe9a0d0a]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-0103dded79e5f5acf]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-09716175b16e4cc39]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0b8fec9737082a00a]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-08904847fa9a1131b]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-092f2bda749033826]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-05299be6bfda232d8]
module.databases.aws_security_group.rds-postgres-sg: Refreshing state... [id=sg-057f01664ce25922c]
module.networking.aws_security_group.tech_challenge_sg: Refreshing state... [id=sg-0bde097ab5cd55b09]
module.alb.aws_security_group.https: Refreshing state... [id=sg-02fdf8c2637c2345a]
module.alb.aws_security_group.egress_all: Refreshing state... [id=sg-092d3094245a1cf4c]
module.alb.aws_security_group.ingress_api: Refreshing state... [id=sg-04b2506502778cda5]
module.alb.aws_security_group.http: Refreshing state... [id=sg-067382b5092931e3a]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-028357546b3b2f9b0]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-035bb6c66c2ca3f57]
module.networking.aws_db_subnet_group.db_subnet: Refreshing state... [id=db_subnet_group]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01c24790e6a2ee28d]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0103dded79e5f5acf1080289494]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-006b7b2d0a1601841]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:loadbalancer/app/tf-lb-20231102152913977300000003/2bf83b156a414b38]
module.databases.aws_db_instance.postgresql_db: Refreshing state... [id=db-BM5HOXJHDF34V4CATK3QIVFTOQ]
module.alb.aws_lb_target_group.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/tf-20231102153143160200000004/39c6c97449726d03]
module.alb.aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener/app/tf-lb-20231102152913977300000003/2bf83b156a414b38/3b0d5b25ae7deffa]
module.ecs.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/soat1-grp13-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:us-west-2:834794241069:task-definition/soat1-grp13-api:12" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:834794241069:task-definition/soat1-grp13-api" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu          = 0
                  - environment  = []
                  - mountPoints  = []
                    name         = "soat1-grp13-api"
                  ~ portMappings = [
                      ~ {
                          - appProtocol   = "http"
                          - hostPort      = 80
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - volumesFrom  = []
                    # (2 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "soat1-grp13-api" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_policy.policy will be destroyed
  # (because aws_iam_policy.policy is not in configuration)
  - resource "aws_iam_policy" "policy" {
      - arn       = "arn:aws:iam::834794241069:policy/getSecretELog" -> null
      - id        = "arn:aws:iam::834794241069:policy/getSecretELog" -> null
      - name      = "getSecretELog" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "Logs"
                    },
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-west-2:834794241069:secret:soat1-grp13-Cfh8wD"
                      - Sid      = "GetSecrets"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA4EXM5HQW2AMJRIZGV" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.ecs.aws_iam_role_policy_attachment.task_exec_additional will be destroyed
  # (because aws_iam_role_policy_attachment.task_exec_additional is not in configuration)
  - resource "aws_iam_role_policy_attachment" "task_exec_additional" {
      - id         = "taskRole-20231102180319309600000001" -> null
      - policy_arn = "arn:aws:iam::834794241069:policy/getSecretELog" -> null
      - role       = "taskRole" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @luiz-soh, Action: `pull_request`*